#pragma once
#define ID_LEN 10
#define WORKER_MAX_NAME_LEN 128

/*
Дефинирайте структура, която представлява работник. Всеки работник има следните характеристики:

id -> идентификатор
име -> низ с произволна дължина (няма да надвиши 128, но да бъде заделена само толкова колкото ни е нужна)
фамилия -> низ с произволна дължина (няма да надвиши 128, но да бъде заделена само толкова колкото ни е нужна)
заплата -> реално число
шеф -> друг работник, като един работник по подразбиране няма шеф, докато не му бъде зададен такъв
*/

struct Worker {
	char ID[ID_LEN] = {};
	char* name = {};
	char* lastName = {};
	double salary;
	Worker* boss = nullptr;
};

bool read(Worker& worker);
void print(const Worker& worker);
void free(Worker& worker);