#include "Array.hpp"
/*
Реализирайте клас Array, който представлява динамичен масив от цели числа. За него трябва да можете:

да прочетете и изведете елементите му на екрана; +
да прочетете и промените елемент на дадена (с индекс) позиция; +
да добавите елемент в края на масива. Ако няма място - да се разшири; +
да сравните два масива за равенство; +
да го сортирате в нарастващ ред; +
да го филтрирате (премахвате някои елементи - остават всички, отговарящи на подадено свойство - предикат); +
обърнете Помислете как можете да оптимизирате някои от операциите - например сортирането да не прави нищо ако знаете, че вече е сортиран.
*/

int main3(){

	try
	{
		Array arr(12);
		arr.append(2);
		arr.append(12);
		arr.append(1111);

		Array arr2(arr);
		Array arr3(2);
		arr3 = arr2;


		arr.filter([](int32_t x) { return x < 13;});
		arr.append(1);
		arr.print();
	}
	catch (const std::exception& ex)
	{
		std::cerr << ex.what();
	}
	
	return 0;
}