#include <fstream>
#include "date.hpp"

/*
Реализирайте клас Date, който да представя дата от календара. Фокусирайте се над коректна капсулация на данните и осигуряване на валидно състояние. С обект от този клас задължително трябва да имате възможност да:

прочитате отделните полета (ден, месец, година); -
променяте датата; -
извеждате дата на екрана; -
извличам кой ден от седмицата е тази дата; -
намирате разликата (в брой дни) между две дати (може да е положителна или отрицателна); 
сравнявате две дати - реализирайте тризначно сравнение (подобно на strcmp); -
прибавяте брой дни към дата (може да е отрицателен). --
*/

int main1() {

	std::ifstream file("Dates.txt");
	if (!file.is_open()) {
		std::cerr << "File cannot be opened for reading!";
		return 0;
	}

	Date date(file, '.');
	Date date2(file, '.');
	
	
	int diff = date2.diff(date);
	date.print();
	std::cout << date.dayOfWeek();
	return 0;
}